[
   {
      "name":"ICCV 2025 Digest",
      "blogFile":"Nov2025_ICCV",
      "date":"November 2025",
      "abs": "Last month I had the pleasure of attending the 2025 International Conference on Computer Vision (ICCV) in Hawaii. After taking a month to digest the experience, and catch up on some deadlines, I decided that for posterity's sake, it might be useful to write down a few observations on the state of AI in 2025.",
      "img":"Nov2025_ICCV.webp",
      "tags":[
         "misc"
      ]
   },
   {
      "name":"Shortcut Learning In Medical Diagnostics",
      "blogFile":"January2025_Shortcuts",
      "date":"January 2025",
      "abs": "`Neural Networks are a black box': train a classification model with labeled images of vehicles and it would start to rely on the presence of water and clouds to classify boats and planes. This reliance on correlated spurious features is an example of Shortcut Learning, an active area of research that touches upon Fairness in ML, explainability, and multi-modality.",
      "img":"January2025_Shortcuts.webp",
      "tags":[
         "AI Fairness",
         "Alignment",
         "Introductory Readings"
      ]
   },
   {
      "name":"AI Fairness In The Wild",
      "blogFile":"April2023_Fairness",
      "date":"November 2024",
      "abs": "The field of AI fairness has been exploding, with many conferences adding special tracks and requiring authors make statements regarding the potential social impact of their work. Here we review some philosophical, technical, and practical papers tackling fairness in machine learning applications.",
      "img":"April2023_Fairness.webp",
      "tags":[
         "AI Fairness",
         "Introductory Readings"
      ]
   },
   {
      "name":"(Hypeless) Introductory Readings in Large Language Models",
      "blogFile":"June2023_LLM",
      "date":"June 2023",
      "abs": "Large Language Models (LLMs) have swiftly made their mark in diverse fields, from education to industry and politics. Yet, despite their popularity, LLMs retain an intriguing air of mysticism even within academic circles. In this exploration, we delve into a selection of research publications that have propelled LLMs to the forefront, shedding light on some technical intricacies and uncovering common threads.",
      "img":"June2023_LLM2.webp",
      "tags":[
         "LLM",
         "Introductory Readings"
      ]
   }
]
